# Задача 1
Загрузите содержимое файла Homework1.csv в DataFrame и выведите первые пять строк на экран. В следующей ячейке посчитайте среднее значение температуры (столбец Temperature) и выведите её на экран.

Чтобы изменить содержимое ячейки, дважды нажмите на нее (или выберите "Ввод")

In [1]:
import pandas as pd
from matplotlib import pyplot as plt

In [24]:
df = pd.read_csv('Homework1.csv')
df.head()

      id        Date           City  Temperature
0  32208  01.01.2012  New York City         47.4
1  32209  02.01.2012  New York City         42.9
2  32210  03.01.2012  New York City         29.8
3  32211  04.01.2012  New York City         19.1
4  32212  05.01.2012  New York City         31.7

In [3]:
df['Temperature'].mean()

58.06857923497273

# Задача 2
Сохраните DataFrame из предыдущей задачи в файл result1.csv, в качестве разделителя используйте запятую ,, а в качестве названия столбца-индекса — index.

In [9]:
df.to_csv("result1.csv", sep=',', index_label='index')

# Задача 3
Загрузите содержимое файла Homework1.csv в DataFrame, при этом отформатируйте столбец с датой (Date) и приведите его к стандартизированному виду. Выведите первые пять строк DataFrame на экран.

In [12]:
df_2 = pd.read_csv('Homework1.csv', parse_dates=['Date'], dayfirst=True)
df_2.head()

      id       Date           City  Temperature
0  32208 2012-01-01  New York City         47.4
1  32209 2012-01-02  New York City         42.9
2  32210 2012-01-03  New York City         29.8
3  32211 2012-01-04  New York City         19.1
4  32212 2012-01-05  New York City         31.7

# Задача 4
Сохраните DataFrame из предыдущей задачи в файл result2.xlsx.

In [14]:
df_2.to_excel("result2.xlsx")

# Задача 5
Загрузите содержимое файла Homework2.csv в DataFrame, укажите правильный разделитель столбцов, отформатируйте столбец с датой (Date) и приведите его к стандартизированному виду. Выведите первые пять строк DataFrame на экран.

In [20]:
df_3 = pd.read_csv('Homework2.csv', sep=';', parse_dates=['Date'], dayfirst=True)
df_3.head()

      id       Date           City  Temperature
0  32208 2012-01-01  New York City         47.4
1  32209 2012-01-02  New York City         42.9
2  32210 2012-01-03  New York City         29.8
3  32211 2012-01-04  New York City         19.1
4  32212 2012-01-05  New York City         31.7

# Задача 6
Сохраните DataFrame из предыдущей задачи в файл result3.xlsx, при сохранении задайте листу имя MySheet.

(Примечание: для указания имени листа в файле Excel как при чтении, так и при записи используется параметр sheet_name.)

In [21]:
df_3.to_excel("result3.xlsx", sheet_name='MySheet')

# Задача 7
Загрузите содержимое файла Homework3.xlsx в DataFrame, отформатируйте столбец с датой (Date) и приведите его к стандартизированному виду. Выведите первые пять строк DataFrame на экран.

После этого в следующей ячейке сохраните полученный DataFrame в этот же файл, в лист с названием MySheet. При сохранении передайте в функцию сохранения параметр index c булевым значением False, чтобы не сохранять столбец-индекс.

Затем откройте файл Homework3.xlsx с помощью Excel или аналога и посмотрите, сколько листов сейчас содержит этот файл. Ответ запишите в секции ### YOUR COMMENTS HERE ### под блоками для кода.

In [22]:
df_4 = pd.read_csv('Homework2.csv', sep=';', parse_dates=['Date'], dayfirst=True)
df_4.head()

      id       Date           City  Temperature
0  32208 2012-01-01  New York City         47.4
1  32209 2012-01-02  New York City         42.9
2  32210 2012-01-03  New York City         29.8
3  32211 2012-01-04  New York City         19.1
4  32212 2012-01-05  New York City         31.7

In [23]:
df_4.to_excel("result3.xlsx", sheet_name='MySheet', index_label=False)

**Ответ:**
1

# Задача 8
Загрузите содержимое файлов Homework1.csv и Homework4.csv в разные датафреймы (DataFrame), выведите первые пять строк каждого датафрейма на экран. После этого объедините датафреймы по столбцу id с использованием метода merge, выведите первые пять строк объединённого датафрейма на экран и запишите объединённый датафрейм в файл result4.csv, указав в качестве разделителя точку с запятой ;.

In [25]:
df_5 = pd.read_csv('Homework4.csv')
df_5.head()

      id  Sales
0  32208     36
1  32209     34
2  32210     40
3  32211     35
4  32212     48

In [26]:
df.head()

      id        Date           City  Temperature
0  32208  01.01.2012  New York City         47.4
1  32209  02.01.2012  New York City         42.9
2  32210  03.01.2012  New York City         29.8
3  32211  04.01.2012  New York City         19.1
4  32212  05.01.2012  New York City         31.7

In [43]:
new_df = df.merge(df_5, how='outer')
new_df.head()

      id        Date           City  Temperature  Sales
0  32208  01.01.2012  New York City         47.4     36
1  32209  02.01.2012  New York City         42.9     34
2  32210  03.01.2012  New York City         29.8     40
3  32211  04.01.2012  New York City         19.1     35
4  32212  05.01.2012  New York City         31.7     48

# Дополнительные (необязательные) задачи
# Задача 9
Загрузите содержимое файлов Homework2.csv и Homework5.xlsx в разные датафреймы (DataFrame), при этом в каждом датафрейме отформатируйте столбец с датой (Date) и приведите его к стандартизированному виду. После этого выведите первые пять строк каждого датафрейма на экран. Затем объедините датафреймы по столбцу Date с использованием метода merge, выведите первые пять строк объединённого датафрейма на экран и запишите объединённый датафрейм в файл result5.csv, указав в качестве разделителя символ табуляции \t.

In [39]:
df_3.head()

      id       Date           City  Temperature
0  32208 2012-01-01  New York City         47.4
1  32209 2012-01-02  New York City         42.9
2  32210 2012-01-03  New York City         29.8
3  32211 2012-01-04  New York City         19.1
4  32212 2012-01-05  New York City         31.7

In [48]:
df_6 = pd.read_excel('Homework5.xlsx', parse_dates=['Date'], dayfirst=True)
df_6.head()

        Date  Sales
0 2012-01-01     36
1 2012-01-02     34
2 2012-01-03     40
3 2012-01-04     35
4 2012-01-05     48

In [54]:
new_d = df_6.merge(df_3, how = 'outer', left_on='Date', right_on='Date')
new_d.head()

        Date  Sales     id           City  Temperature
0 2012-01-01     36  32208  New York City         47.4
1 2012-01-02     34  32209  New York City         42.9
2 2012-01-03     40  32210  New York City         29.8
3 2012-01-04     35  32211  New York City         19.1
4 2012-01-05     48  32212  New York City         31.7

In [55]:
new_d.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 366 entries, 0 to 365
Data columns (total 5 columns):
Date           366 non-null datetime64[ns]
Sales          366 non-null int64
id             366 non-null int64
City           366 non-null object
Temperature    366 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(1)
memory usage: 17.2+ KB

In [56]:
new_d.to_csv("result5.csv", sep='\t')

# Задача 10
Вы могли заметить, что столбец Temperature всех предыдущих датафреймов содержит достаточно высокое значение. Это потому, что данные по температуре приведены для города Нью-Йорк, а в США принято измерять температуру в градусах Фаренгейта, а не Цельсия. Для перевода температуры из градусов Фаренгейта в градусы Цельсия используется следующая формула:

TC=(TF−32)×5/9, 

где  TF  — температура в градусах Фаренгейта, а  TC  — температура в градусах Цельсия.

Используя приведённую формулу, добавьте в объединённый датафрейм из предыдущей задачи новый столбец Temperature_C, содержащий температуру в градусах Цельсия. Данные по температуре в градусах Фаренгейта приведены в столбце Temperature. Полученный датафрейм сохраните в файл result6.csv.

In [59]:
new_d['Temperature_C'] = ((new_d['Temperature'] * 9)/5) + 32
new_d.head()

        Date  Sales     id           City  Temperature  Temperature_C
0 2012-01-01     36  32208  New York City         47.4         117.32
1 2012-01-02     34  32209  New York City         42.9         109.22
2 2012-01-03     40  32210  New York City         29.8          85.64
3 2012-01-04     35  32211  New York City         19.1          66.38
4 2012-01-05     48  32212  New York City         31.7          89.06